src/cf/Enums/ВидыДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеСвязанныхОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШаблонСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетСкидкиНаценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверкаУсловияПредоставленияСкидкиНаценки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ДополнительныеОтчетыИОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ДополнительныеОтчетыИОбработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БезопасныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляФормыОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляФормыСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публикация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПубликацииДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетХранилищеВариантов</Name>
					<Comment>Когда Истина то дополнительный отчет подключен к хранилищу вариантов "ХранилищеВариантовОтчетов".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТеснаяИнтеграцияСФормойОтчета</Name>
					<Comment>Когда Истина то у отчета есть программный интерфейс для тесной интеграции с общей формой "ФормаОтчета".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСовместимостиРазрешений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыСовместимостиРазрешенийДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантЗапуска</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВызоваДополнительныхОбработок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказыватьОповещение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегламентноеЗаданиеGUID</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скрыть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменяемыеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Назначение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНазначения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПолноеИмяОбъектаМетаданных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Разделы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьИмяРаздела</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Разрешения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРазрешения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/Б24_ОбщиеНастройки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбрезатьИсториюОбменов 	 = Б24_ОбщегоНазначенияСервер.ПолучитьЗначениеХранилищаНастроек("Логирование","ОбрезатьИсториюОбменов");
	ЧислоДнейХраненияИстории = Б24_ОбщегоНазначенияСервер.ПолучитьЗначениеХранилищаНастроек("Логирование","ЧислоДнейХраненияИстории");
	РежимОтладки 			 = Б24_ОбщегоНазначенияСервер.ПолучитьЗначениеХранилищаНастроек("Логирование","РежимОтладки");
	
	ЧислоДнейХраненияИстории = ?(ЗначениеЗаполнено(ЧислоДнейХраненияИстории), ЧислоДнейХраненияИстории, 7);
	ОбрезатьИсториюОбменов   = ?(ЗначениеЗаполнено(ОбрезатьИсториюОбменов), ОбрезатьИсториюОбменов, Истина);
	
	РежимОтладки 			 = ?(ЗначениеЗаполнено(РежимОтладки), РежимОтладки, Ложь);
	
	НастройкаСинхронизацииДляЗагрузкиВРежимеРеальногоВремени = Б24_ОбщегоНазначенияСервер.ПолучитьЗначениеХранилищаНастроек("РежимРеальногоВремени","НастройкаСинхронизацииДляЗагрузкиВРежимеРеальногоВремени");
	
	РасписаниеИспользуется 	 = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.Б24_ЗаданиеСинхронизацииДанных).Использование;
	РасписаниеРегламентногоЗадания 	= РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.Б24_ЗаданиеСинхронизацииДанных).Расписание;	
	
	ВыгрузкаПечатныхФормВБитрикс24 	= Б24_ОбщегоНазначенияСервер.ПолучитьЗначениеХранилищаНастроек("ВыгрузкаПечатныхФорм", "ВыгрузкаПечатныхФормВБитрикс24");
	ВестиРеестрПечатныхФорм			= Б24_ОбщегоНазначенияСервер.ПолучитьЗначениеХранилищаНастроек("ВыгрузкаПечатныхФорм", "ВестиРеестрПечатныхФорм");
	
	ТипДокументаЗаказа = Б24_ОбщегоНазначенияСервер.ПолучитьЗначениеХранилищаНастроек("Заказы","ТипДокументаЗаказа");
	ТипДокументаЗаказа = ?(ЗначениеЗаполнено(ТипДокументаЗаказа), ТипДокументаЗаказа, "Сделка");

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьНадписьРасписанияОбмена();
	
	Если РасписаниеИспользуется тогда
		Элементы.НастроитьРасписаниеОбмена.Доступность = Истина;	
	Иначе
		Элементы.НастроитьРасписаниеОбмена.Доступность = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ДобавлениеМодуляНаНачальнуюСтраницу

&НаКлиенте
Процедура ДобавитьМодульНаНачальнуюСтраницу(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Добавить в левую колонку?", РежимДиалогаВопрос.ДаНет, 0); 

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
		ДобавитьМодульВНачальнуюСтраницу("Лево");
	Иначе
		ДобавитьМодульВНачальнуюСтраницу("Право");
	КонецЕсли;

	ОбновитьИнтерфейс();

КонецПроцедуры

&НаСервере
Процедура ДобавитьМодульВНачальнуюСтраницу(Колонка)
	Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ДобавитьМодульВНачальнуюСтраницу(Колонка);
	
КонецПроцедуры

#КонецОбласти


#Область УстановкиПоЛогированию

&НаКлиенте
Процедура  СохранениеИнформацииОЛогированииКлиент(Элемент)
	СохранениеИнформацииОЛогированииСервер();
КонецПроцедуры

&НаСервере
Процедура СохранениеИнформацииОЛогированииСервер()
	
	Результат = Новый Структура;
	Результат.Вставить("ОбрезатьИсториюОбменов"	 , ОбрезатьИсториюОбменов);
	Результат.Вставить("ЧислоДнейХраненияИстории", ЧислоДнейХраненияИстории);
	Результат.Вставить("РежимОтладки"			 , РежимОтладки);
	
	Б24_ОбщегоНазначенияСервер.УстановитьЗначениеВХранилищаНастроек("Логирование", Результат)
	
КонецПроцедуры

#КонецОбласти


#Область УстановкиПоРежимуРеальногоВремени

&НаКлиенте
Процедура НастройкаСинхронизацииДляЗагрузкиВРежимеРеальногоВремениПриИзмененииКлиент(Элемент)
	НастройкаСинхронизацииДляЗагрузкиВРежимеРеальногоВремениПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура НастройкаСинхронизацииДляЗагрузкиВРежимеРеальногоВремениПриИзмененииСервер()
	
	Результат = Новый Структура;
	Результат.Вставить("НастройкаСинхронизацииДляЗагрузкиВРежимеРеальногоВремени"	 , НастройкаСинхронизацииДляЗагрузкиВРежимеРеальногоВремени);
	                                                                                                                                                       
	Б24_ОбщегоНазначенияСервер.УстановитьЗначениеВХранилищаНастроек("РежимРеальногоВремени", Результат)
	
КонецПроцедуры

#КонецОбласти


#Область УстановкиПоРежимуПоРасписанию

&НаКлиенте
Процедура НастроитьРасписаниеОбмена(Команда)
	
	ВыполнитьНастройкуРасписанияОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуРасписанияОбмена()
	
	Если Типзнч(РасписаниеРегламентногоЗадания)<>Тип("РасписаниеРегламентногоЗадания") Тогда
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьИзменятьРасписание", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИзменятьРасписание(РасписаниеЗадания, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеРегламентногоЗадания = РасписаниеЗадания;
	
	ОбновлениеРасписания(Истина);
	
	УстановитьНадписьРасписанияОбмена();
	
КонецПроцедуры

&НаСервере
Процедура ОбновлениеРасписания(ИспользованиеРасписание)
	
	Если Типзнч(РасписаниеРегламентногоЗадания)<>Тип("РасписаниеРегламентногоЗадания") Тогда
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.Б24_ЗаданиеСинхронизацииДанных);
	РеглЗадание.Расписание 		= РасписаниеРегламентногоЗадания; 	
	РеглЗадание.Использование 	= ИспользованиеРасписание;
	РеглЗадание.Записать();	
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьЗаписьОДополнительнойОбработкеДляРасписания()
	
	ВерсияОбработки = "1.0"; 
	
	НаименованиеОбъекта = "Выполнение синхронизации с Битрикс24 по расписанию";
	Публикация 			= Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", НаименованиеОбъекта);
	Запрос.УстановитьПараметр("Публикация"	, Публикация);
	Запрос.УстановитьПараметр("Версия"		, ВерсияОбработки);
	Запрос.Текст = "ВЫБРАТЬ
	|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	|ГДЕ
	|	ДополнительныеОтчетыИОбработки.Наименование = &Наименование
	|	И ДополнительныеОтчетыИОбработки.Публикация = &Публикация
	|	И ДополнительныеОтчетыИОбработки.ПометкаУдаления = ЛОЖЬ
	|	И ДополнительныеОтчетыИОбработки.Версия = &Версия";
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	ЗаписьСОбработкой = Неопределено;
	
	Если НЕ ВыполненныйЗапрос.Пустой() тогда
		ТзнДанных = ВыполненныйЗапрос.Выгрузить();
		ЗаписьСОбработкой = ТзнДанных[0].Ссылка;
	Иначе
		                   
		МакетСОбработкой = Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("ОбработкаУстановкиРасписания");
		
		НоваяОбработка = Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
		
		НоваяОбработка.Наименование = НаименованиеОбъекта;
		НоваяОбработка.Публикация	= Публикация;
		НоваяОбработка.БезопасныйРежим = Ложь;
		НоваяОбработка.Вид 			= Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка;
		НоваяОбработка.Версия       = ВерсияОбработки;
		НоваяОбработка.ИмяОбъекта	= "БитриксВыполнениеСинхронизацииПоРасписанию";
		НоваяОбработка.ИмяФайла		= "БитриксВыполнениеСинхронизацииПоРасписанию.epf";
		НоваяОбработка.РежимСовместимостиРазрешений = Перечисления.РежимыСовместимостиРазрешенийДополнительныхОтчетовИОбработок.Версия_2_2_2; 
		НоваяОбработка.Информация	= "Обработка выполняет синхронизацию с Битрикс24 по расписанию";
		НоваяОбработка.ХранилищеОбработки = Новый ХранилищеЗначения(МакетСОбработкой);
		
		
		НоваяКоманда = НоваяОбработка.Команды.Добавить();
		НоваяКоманда.Идентификатор = "ОткрытьГлобально";
		НоваяКоманда.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода;
		НоваяКоманда.Представление = НаименованиеОбъекта;
		НоваяКоманда.РегламентноеЗаданиеGUID = Новый УникальныйИдентификатор;
		НоваяОбработка.Записать();
		
		ЗаписьСОбработкой = НоваяОбработка.Ссылка;
		
	КонецЕсли;
	
	Возврат ЗаписьСОбработкой; 
	
КонецФункции

&НаКлиенте
Процедура УстановитьНадписьРасписанияОбмена()
	
	Если РасписаниеРегламентногоЗадания = НеОпределено Тогда
		ТекстЗаголовка = НСтр("ru='Настроить расписание обмена'");
	Иначе
		ТекстЗаголовка = РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Элементы.НастроитьРасписаниеОбмена.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРегламентноеЗадание()
	
	ЗаписьСОбработкой = ПолучитьЗаписьОДополнительнойОбработкеДляРасписания();
	
	Если ЗаписьСОбработкой = Неопределено тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если ЗаписьСОбработкой.Команды.количество()= 0 тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ТекРегламентноеЗадание = ЗаписьСОбработкой.Команды[0].РегламентноеЗаданиеGUID;
	
	Возврат ТекРегламентноеЗадание; 
	
КонецФункции

&НаКлиенте
Процедура РасписаниеИспользуетсяПриИзменении(Элемент)
	
	Если РасписаниеИспользуется тогда
		Элементы.НастроитьРасписаниеОбмена.Доступность = Истина;	
	Иначе
		Элементы.НастроитьРасписаниеОбмена.Доступность = Ложь;	
	КонецЕсли;
	
	ОбновлениеРасписания(РасписаниеИспользуется);
	
	СохранениеИнформацииОСинхронизацииПоРасписанию();
	
КонецПроцедуры

&НаСервере
Процедура СохранениеИнформацииОСинхронизацииПоРасписанию()
	
	Результат = Новый Структура;
	Результат.Вставить("РасписаниеИспользуется", РасписаниеИспользуется);
	
	Б24_ОбщегоНазначенияСервер.УстановитьЗначениеВХранилищаНастроек("СинхронизацияПоРасписанию", Результат)
	
КонецПроцедуры

#КонецОбласти


#Область УстановкиПоВыгрузкеПечатныхФорм

&НаКлиенте
Процедура ВыгрузкаПечетныхФормВБитрикс24ПриИзменении(Элемент)
	
	СохранениеИнформацииОВыгрузкеПечетныхФормСервер();
	
	НужноПерезапускать = ДобавитьОбновитьРасширениеПечатныхФорм();
	
	Если НужноПерезапускать = Истина тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПерезапуске", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Расширение для печатных форм было установлено/обновлено. Изменения будут приняты после перазапуска клиента. Перезапустить?", РежимДиалогаВопрос.ДаНет, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьОбновитьРасширениеПечатныхФорм()
	
	НужноПерезапускать = Ложь;	
	
	Если ВыгрузкаПечатныхФормВБитрикс24 = Истина тогда
		
		НайденныеРасширения = РасширенияКонфигурации.Получить(Новый Структура("Имя", "Б24_ПечатныеФормы"));
		
		Если НайденныеРасширения.Количество() = 0 тогда
			
			ОписаниеЗащитыОтОпасныхДействий  = Новый ОписаниеЗащитыОтОпасныхДействий;
			ОписаниеЗащитыОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
			
			ИмяФайла = ПолучитьИмяВременногоФайла("cfe");
			Макет = Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("РасширениеПечатныхФорм");
			Макет.Записать(ИмяФайла);

			
			НовоеРасширение = РасширенияКонфигурации.Создать();
			НовоеРасширение.БезопасныйРежим 		= Ложь;
			НовоеРасширение.Активно 				= Истина;
			НовоеРасширение.ЗащитаОтОпасныхДействий = ОписаниеЗащитыОтОпасныхДействий;
			НовоеРасширение.Записать(Новый ДвоичныеДанные(ИмяФайла));
			
			УдалитьФайлы(ИмяФайла);
			
			НужноПерезапускать = Истина;
			
		Иначе
				
			Расширение = НайденныеРасширения[0];
			Расширение.Активно = Истина;;
			Расширение.Записать();
			
			НужноПерезапускать = Истина;
			
		КонецЕсли;
		
	Иначе
		
		НайденныеРасширения = РасширенияКонфигурации.Получить(Новый Структура("Имя", "Б24_ПечатныеФормы"));
		Если НайденныеРасширения.Количество() > 0 тогда
			Расширение = НайденныеРасширения[0];
			Расширение.Активно = Ложь;;
			Расширение.Записать();
			
			НужноПерезапускать = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НужноПерезапускать;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПерезапуске(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ЗавершитьРаботуСистемы(Ложь,Истина)

КонецПроцедуры


&НаКлиенте
Процедура ВестиРеестрПечатныхФормПриИзменении(Элемент)
	СохранениеИнформацииОВыгрузкеПечетныхФормСервер();
КонецПроцедуры

&НаСервере
Процедура СохранениеИнформацииОВыгрузкеПечетныхФормСервер()
	
	Результат = Новый Структура;
	Результат.Вставить("ВыгрузкаПечатныхФормВБитрикс24"	, ВыгрузкаПечатныхФормВБитрикс24);
	Результат.Вставить("ВестиРеестрПечатныхФорм"	 	, ВестиРеестрПечатныхФорм);
	
	Б24_ОбщегоНазначенияСервер.УстановитьЗначениеВХранилищаНастроек("ВыгрузкаПечатныхФорм", Результат);
	
КонецПроцедуры

#КонецОбласти


#Область УстановкиПоВыгрузкеПечатныхФорм

&НаКлиенте
Процедура ТипДокументаЗаказаПриИзменении(Элемент)
	СохранениеИнформацииОЗаказахСервер();
КонецПроцедуры

&НаСервере
Процедура СохранениеИнформацииОЗаказахСервер()
	
	Результат = Новый Структура;
	Результат.Вставить("ТипДокументаЗаказа"	 , ТипДокументаЗаказа);
	
	Б24_ОбщегоНазначенияСервер.УстановитьЗначениеВХранилищаНастроек("Заказы", Результат)
	
КонецПроцедуры

#КонецОбласти
